app/controllers/comments_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "comment hello"], ["commenter", "test"], ["created_at", Sun, 18 Nov 2012 18:54:22 UTC +00:00], ["post_id", 2], ["updated_at", Sun, 18 Nov 2012 18:54:22 UTC +00:00]]
---
	def create
		@post = Post.find(params[:post_id])
		@post.user = current_user
		@comment = @post.comments.create(params[:comment])