app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "dsadsdsa"], ["created_at", Mon, 19 Nov 2012 18:57:37 UTC +00:00], ["title", "ereasdasd"], ["updated_at", Mon, 19 Nov 2012 18:57:37 UTC +00:00], ["user_id", 3]]
---
  def create
    @post = Post.new(params[:post])
    @post.user = current_user

    respond_to do |format|
      if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "posts" SET "title" = 'test111', "updated_at" = '2012-11-19 18:45:42.658375' WHERE "posts"."id" = 1
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])